// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
//и проверяет, является ли этот день выходным.
//6, 7 - выходной.
//НО дня с индексом 0 или 12 не существует.
//6 -> да
//7 -> да
//1 -> нет
Console.WriteLine("Напишите число дня недели");
int a = int.Parse(Console.ReadLine());
int a=1;
int b=2;
int c=3;
int d=4;
int e=5;
int f=6;
int g=7;
if (a ==6) or (a==7) {
    Console.WriteLine("yes");
}